"use strict"

// Завдання:

// №1 Створіть змінну, яка зберігає ім'я користувача. Виведіть значення цієї змінної в консоль.

// №2 Створіть змінну, яка зберігає вік користувача. Перетворіть цю змінну на рядок і виведіть тип цієї змінної в консоль.

// №3 Створіть змінну, яка зберігає число "10" і додайте до нього рядок "20". Виведіть результат і його тип.

// №1 
let useName = "Anastasiia";
console.log(useName);

// №2
let useAge = 27;
useAge = String(useAge);
console.log(useAge);
console.log(typeof useAge);

// №3
let a = 10;
a  += "20";
console.log(a);
console.log(typeof a);